tutorials/CFD/12simpleSteadyNS_ECP/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
9000
(
(0.02 0.0125 0.05)
(0.06 0.0125 0.05)
(0.1 0.0125 0.05)
(0.14 0.0125 0.05)
(0.18 0.0125 0.05)
(0.22 0.0125 0.05)
(0.26 0.0125 0.05)
(0.3 0.0125 0.05)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0 0.0125 0.05)
(0 0.0375 0.05)
(0 0.0625 0.05)
(0 0.0875 0.05)
(0 0.1125 0.05)
(0 0.1375 0.05)
(0 0.1625 0.05)
(0 0.1875 0.05)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
70
(
(7 -0.655556 0.05)
(7 -0.633333 0.05)
(7 -0.611111 0.05)
(7 -0.588889 0.05)
(7 -0.566667 0.05)
(7 -0.544444 0.05)
(7 -0.522222 0.05)
(7 -0.5 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
330
(
(0.02 0 0.05)
(0.06 0 0.05)
(0.1 0 0.05)
(0.14 0 0.05)
(0.18 0 0.05)
(0.22 0 0.05)
(0.26 0 0.05)
(0.3 0 0.05)
...
)
;
    }
}


// ************************************************************************* //
