tutorials/CFD/12simpleSteadyNS_ECP/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9000
(
0.02
0.06
0.1
0.14
0.18
0.22
0.26
0.3
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
7
7
7
7
7
7
7
7
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
330
(
0.02
0.06
0.1
0.14
0.18
0.22
0.26
0.3
...
)
;
    }
}


// ************************************************************************* //
