tutorials/CFD/12simpleSteadyNS_ECP/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
9000
(
0.0125
0.0125
0.0125
0.0125
0.0125
0.0125
0.0125
0.0125
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.0125
0.0375
0.0625
0.0875
0.1125
0.1375
0.1625
0.1875
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
70
(
-0.655556
-0.633333
-0.611111
-0.588889
-0.566667
-0.544444
-0.522222
-0.5
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
330
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
