tutorials/CFD/12simpleSteadyNS_ECP/system/topoSetDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    // Random interior sampling
    {
        name    hrSamples;
        type    cellSet;
        action  new;
        source  labelToCell;

        value
        (
            6
            9
            18
            27
            35
            42
            43
            53
            58
            90
            96
            106
            117
            128
            152
            158
            166
            188
            200
            207
            224
            231
            241
            251
            282
            317
            319
            320
            333
            339
            344
            387
            400
            406
            409
            420
            423
            434
            441
            444
            452
            470
            472
            474
            475
            488
            508
            514
            520
            525
            534
            588
            590
            601
            606
            626
            634
            651
            653
            659
            672
            685
            711
            715
            722
            727
            745
            750
            753
            757
            771
            821
            822
            823
            828
            832
            841
            845
            853
            878
            887
            888
            893
            916
            931
            936
            949
            958
            960
            964
            977
            986
            993
            998
            1020
            1040
            1049
            1052
            1070
...
        );
    }

    // Add cells adjacent to physical boundaries
    {
        name    hrSamples;
        type    cellSet;
        action  add;
        source  patchToCell;

        patches
        (
            inlet
            outlet
            walls
        );
    }
);
